import { CalendarDays } from "lucide-react";

export default function PrivacyPage() {
    return (<>
        <title>Політика конфіденційності</title>
        <div className="legal">
            <div className="space-y-1">
                <h1 className="text-xl sm:text-2xl md:text-3xl text-foreground font-bold">Політика конфіденційності</h1>
                <div className="text-xs text-muted font-medium flex items-center gap-1">
                    <CalendarDays size={14} />
                    <div>Оновлено: 2 грудня 2025</div>
                </div>
            </div>
            <section>
                <p>Ця сторінка пояснює, яку інформацію може збирати вебсайт і браузерне розширення Movie Timecode, з якою метою
                    та як вона використовується. Використання сайту або браузерного розширення означає автоматичну згоду з цією
                    політикою.</p>
            </section>
            <section>
                <h3>Збір та обробка інформації</h3>
                <p>Movie Timecode не збирає жодних персональних даних користувачів, окрім випадків, коли користувач самостійно
                    проходить авторизацію через Twitch. У такому разі збирається лише необхідна інформація:</p>
                <ul>
                    <li>ID користувача — використовується для ідентифікації вашого облікового запису Twitch.</li>
                    <li>Ім'я користувача (username).</li>
                    <li>Аватар.</li>
                    <li>Токен доступу та токен оновлення — ці токени потрібні для роботи таких функцій, як чат-бот. Вони тимчасово зберігаються на сервері під час авторизації, щоб передати їх розширенню для подальшого зберігання та обробки. Після цього токени автоматично видаляються з сервера.</li>
                </ul>
                <p>При використанні функцій розширення інші користувачі можуть бачити ваше ім'я користувача та аватар, але інші дані, отримані з Twitch, залишаються недоступними для інших користувачів.</p>

                <h4>Технічні дані</h4>
                <p>Під час користування сайтом і браузерним розширенням браузер автоматично передає певні технічні дані, такі як
                    IP-адреса, User Agent <i>(інформація про браузер і пристрій)</i>. Ці дані можуть оброблятися та в деяких
                    випадках збиратися для забезпечення роботи сервісу, його покращення і захисту від зловживань.</p>
            </section>
            <section>
                <h3>Файли cookie</h3>
                <p>Файли cookie — це невеликі файли даних, які зберігаються на ваших пристроях під час відвідування будь-якого
                    сайту. Вони допомагають сайту запам’ятовувати ваші налаштування та покращувати роботу сервісу.</p>
            </section>
            <section>
                <h3>Взаємодія розширення з сайтами</h3>
                <p>Розширення Movie Timecode має доступ лише до тих веб-сайтів, які перераховані в його маніфесті:</p>
                <ul>
                    <li>Movie Timecode.</li>
                    <li>UAKino.</li>
                </ul>
                <p>Це обмеження гарантує, що розширення не отримує доступ до інших веб-сайтів, забезпечуючи безпеку та належну роботу для користувачів.</p>
                <p>Окрім цього, якщо увімкнена функція чат-бота, розширення може підключатися до вашого Twitch-чату через Twitch API. Це дозволяє надсилати повідомлення від вашого імені та читати повідомлення з чату, щоб забезпечити роботу чат-бота.</p>
            </section>
            <section>
                <h3>Зміни до політики конфіденційності</h3>
                <p>Усі оновлення та зміни до цієї Політики конфіденційності будуть опубліковані на цій сторінці та набирають чинності з моменту їх публікації. </p>
            </section>
        </div>
    </>);
};