import { CalendarDays } from "lucide-react";

export default function PrivacyPage() {
    return (<>
        <title>Політика конфіденційності</title>
        <div className="legal">
            <div className="space-y-1">
                <h1 className="text-xl sm:text-2xl md:text-3xl text-foreground font-bold">Політика конфіденційності</h1>
                <div className="text-xs text-muted font-medium flex items-center gap-1">
                    <CalendarDays size={14} />
                    <div>Оновлено: 15 січня 2026</div>
                </div>
            </div>
            <section>
                <p>Ця сторінка пояснює, яку інформацію може збирати вебсайт і браузерне розширення Movie Timecode, з якою метою
                    та як вона використовується. Використання сайту або браузерного розширення означає автоматичну згоду з цією
                    політикою.</p>
            </section>
            <section>
                <h3>Збір та обробка інформації</h3>
                <p>Movie Timecode не збирає жодних персональних даних користувачів, окрім випадків, коли користувач самостійно
                    проходить авторизацію через Twitch. У такому разі збирається лише необхідна інформація:</p>
                <ul>
                    <li>ID користувача — використовується для ідентифікації вашого облікового запису Twitch.</li>
                    <li>Ім'я користувача (username).</li>
                    <li>Аватар.</li>
                    <li>Токен доступу та токен оновлення — ці токени потрібні для роботи таких функцій, як чат-бот. Вони тимчасово зберігаються на сервері під час авторизації, щоб передати їх розширенню для подальшого зберігання та обробки. Після цього токени автоматично видаляються з сервера.</li>
                </ul>
                <p>При використанні функцій розширення інші користувачі можуть бачити ваше ім'я користувача та аватар, але інші дані, отримані з Twitch, залишаються недоступними для інших користувачів.</p>

                <h4>Аналітичні дані</h4>
                <p>Вебсайт і браузерне розширення можуть автоматично збирати інформацію про використання сервісу, наприклад застосування таймкодів, перевірку фільмів та інші дії. Для цього на вашому пристрої створюється унікальний анонімний ідентифікатор, який дозволяє збирати ці дані без можливості прив’язки до конкретного користувача.</p>
                <p>Отримана інформація використовується для реалізації окремих функцій сервісу (наприклад, збереження останніх перевірених фільмів) та для покращення роботи сервісу.</p>

                <h4>Технічні дані</h4>
                <p>Під час користування сайтом і браузерним розширенням браузер автоматично передає обмежений набір технічної інформації, зокрема IP-адресу та User Agent <i>(відомості про браузер і пристрій)</i>. Ці дані можуть використовуватися для захисту від зловживань сервісом.</p>
            </section>
            <section>
                <h3>Авторизація через Twitch</h3>
                <p>Для авторизація на вебсайті та в розширенні використовується ваш обліковий запис Twitch для ідентифікації вас як користувача. Після цього взаємодія відбувається через внутрішній обліковий запис, який автоматично створюється під час входу через Twitch.</p>
                <p>Під час авторизації на вебсайті або в розширенні сервіс може запитувати додаткові права доступу до Twitch для отримання та керування певними даними. Ці права використовуються лише якщо ви активуєте відповідні функції або ними користуєтеся.</p>
                <p>Нижче наведено перелік дозволів, які можуть бути запитані під час авторизації:</p>
                <div className="overflow-x-auto">
                    <table className="table-border table-auto min-w-xl">
                        <thead>
                            <tr>
                                <th>Дозвіл</th>
                                <th>Опис</th>
                                <th className="whitespace-nowrap">Потрібно для</th>
                            </tr>
                        </thead>
                        <tbody>
                            <tr>
                                <td className="text-sm font-medium">user:read:email</td>
                                <td className="text-sm">Стандартний дозвіл для отримання інформації про ваш обліковий запис. Відповідно до розділу «Збір та обробка інформації», сервіс ігнорує ваш email та не обробляє і не зберігає його.</td>
                                <td className="text-sm">Вебсайту та розширення</td>
                            </tr>
                            <tr>
                                <td className="text-sm font-medium">chat:read та chat:edit</td>
                                <td className="text-sm">Дозволяють взаємодіяти з вашим чатом на Twitch для функції чат-бота, якщо ця функція увімкнена. Вся взаємодія відбувається локально на вашому пристрої, без підключення до серверу.</td>
                                <td className="text-sm">Розширення</td>
                            </tr>
                            <tr>
                                <td className="text-sm font-medium">channel:manage:broadcast</td>
                                <td className="text-sm">Дозволяє керувати налаштуваннями трансляції, такими як назва трансляції, теги та класифікація контенту. Розширення використовує цей дозвіл лише для керування класифікацією контенту, якщо ця функція увімкнена.</td>
                                <td className="text-sm">Розширення</td>
                            </tr>
                        </tbody>
                    </table>
                </div>
            </section>
            <section>
                <h3>Файли cookie</h3>
                <p>Файли cookie — це невеликі файли даних, які зберігаються на ваших пристроях під час відвідування будь-якого
                    сайту. Вони допомагають сайту запам’ятовувати ваші налаштування та покращувати роботу сервісу.</p>
            </section>
            <section>
                <h3>Взаємодія розширення з сайтами</h3>
                <p>Розширення Movie Timecode має доступ лише до тих вебсайтів, які перераховані в його маніфесті:</p>
                <ul>
                    <li>Movie Timecode.</li>
                    <li>UAKino.</li>
                </ul>
                <p>Це обмеження гарантує, що розширення не отримує доступ до інших вебсайтів, забезпечуючи безпеку та належну роботу для користувачів.</p>
                <p>Окрім цього, якщо увімкнена функція чат-бота, розширення може підключатися до вашого Twitch-чату через Twitch API. Це дозволяє надсилати повідомлення від вашого імені та читати повідомлення з чату, щоб забезпечити роботу чат-бота.</p>
            </section>
            <section>
                <h3>Зміни до політики конфіденційності</h3>
                <p>Усі оновлення та зміни до цієї Політики конфіденційності будуть опубліковані на цій сторінці та набирають чинності з моменту їх публікації. </p>
            </section>
        </div>
    </>);
};