<?php

return [
    'checkRecommendation' => [
        'production' => 'Перегляд цього фільму не рекомендований через високий ризик блокування з боку правовласників',
        'productionYear' => 'Перегляд цього фільму не рекомендований через високий ризик блокування з боку правовласників та надто новий реліз',
        'distributor' => 'Перегляд цього фільму ризикований через наявність ризику блокування з боку дистриб’юторів. Якщо у заставці не зазначено виділених дистриб’юторів, можна ризикнути',
        'distributorYear' => 'Перегляд цього фільму ризикований через наявність ризику блокування з боку дистриб’юторів та надто новий реліз',
        'year' => 'Фільм занадто новий, краще почекати',
        'safe' => 'Фільм здається безпечним для перегляду (але це не точно 😅)',
    ]
];
