<?php

return [
    'checkRecommendation' => [
        // Production
        'noProduction' => 'Ризики перегляду цього фільму невідомі, оскільки не вдалося отримати дані про правовласників',
        'noProductionYear' => 'Фільм є надто новим, а інші ризики перегляду наразі невідомі через відсутність даних про правовласників.',

        'production' => 'Перегляд цього фільму не рекомендований через високий ризик блокування з боку правовласників',
        'productionYear' => 'Перегляд цього фільму не рекомендований через високий ризик блокування з боку правовласників та новизну фільму',

        // Distributor
        'noDistributor' => 'Фільм пройшов перевірку на правовласників, але перевірку на дистриб’юторів не вдалося виконати через відсутність даних про них. Якщо у заставці фільму не зазначено небезпечних дистриб’юторів, можна ризикнути.',
        'noDistributorYear' => 'Фільм пройшов перевірку на правовласників, але перевірку на дистриб’юторів не вдалося виконати через відсутність даних про них. Також фільм є надто новим',

        'distributor' => 'Перегляд цього фільму ризикований через наявність ризику блокування з боку дистриб’юторів. Якщо у заставці не зазначено виділених дистриб’юторів, можна ризикнути',
        'distributorYear' => 'Перегляд цього фільму ризикований через наявність ризику блокування з боку дистриб’юторів та новизну фільму',

        // Year
        'year' => 'Фільм занадто новий, краще почекати',
        'safe' => 'Фільм здається безпечним для перегляду (але це не точно 😅)',
    ]
];
